
&НаКлиенте
Процедура Забронировать(Команда)
	ЗабронироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗабронироватьНаСервере()
	
	МассивДокументов = Элементы.Список.ВыделенныеСтроки;
	
	Для каждого ОчереднойДокумент Из МассивДокументов Цикл
	
		НаборЗаписей = РегистрыНакопления.ЗабронированныеТовары.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Регистратор.Установить(ОчереднойДокумент);
		
		Для каждого ТекСтрокаТовары Из ОчереднойДокумент.Товары Цикл
		
			Движение = НаборЗаписей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ОчереднойДокумент.Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Количество = ТекСтрокаТовары.Количество;

		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
