Процедура УстановитьПодразделенияПроводки(Проводка, ПодразделениеДт, ПодразделениеКт) Экспорт

	ПараметрыОпций = Новый Структура;
	
	ПараметрыОпций.Вставить("Организация", Проводка.Организация);
	
	УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ПоПодразделениям", ПараметрыОпций);
	
	Если УчетПоПодразделениям Тогда
	
		УстановитьПодразделениеВПроводке(Проводка, ПодразделениеДт, "Дт");
		УстановитьПодразделениеВПроводке(Проводка, ПодразделениеКт, "Кт");
	
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьПодразделениеВПроводке(Проводка, Подразделение, ДтКт)
			
	Если Проводка["Счет" + ДтКт].ПоПодразделениям Тогда
	
		 Проводка["Подразделение" + ДтКт] = Подразделение;
	
	КонецЕсли;

КонецПроцедуры