
&НаКлиенте
Процедура ВыдатьВернуть(Команда)
	ВыдатьВернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыдатьВернутьНаСервере()  
	
	Если ТипДвижения = "Выдача" Тогда
	
	НовыйДокумент = Документы.ВыдачаОборудования.СоздатьДокумент(); 
	
	Иначе 
	
	НовыйДокумент = Документы.ВозвратОборудования.СоздатьДокумент();
	
	КонецЕсли;
	
	НовыйДокумент.Дата = ТекущаяДата();
	
	НовыйДокумент.Организация = Организация;
	
	НовыйДокумент.Сотрудник = Сотрудник;
	
	НовыйДокумент.Склад = Склад;
	
	Для Каждого ОчереднаяСтрока из Состав Цикл
		
		НоваяСтрока = НовыйДокумент.Состав.Добавить();
		
		НоваяСтрока.Оборудование = ОчереднаяСтрока.Оборудование;
		
		НоваяСтрока.Количество = ОчереднаяСтрока.Количество;
		
	КонецЦикла;        
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
