
&НаКлиенте
Процедура Забронировать(Команда)
	ЗабронироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗабронироватьНаСервере()
	
	НакладнаяОбъект = РеквизитФормыВЗначение("Объект");
	
	НакладнаяОбъект.ЗабронироватьТовар();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьБронь(Команда)
	СнятьБроньНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьБроньНаСервере()
	
	НаборЗаписей = РегистрыНакопления.ЗабронированныеТовары.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
