
//&НаКлиенте
//Процедура УстановкаФО()
//		
//	ПараметрыОпций = Новый Структура;
//	
//	ПараметрыОпций.Вставить("Организация", Объект.Организация);
//	
//	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпций);

//КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	РаботаВФО.УстановкаФООрганизацияДляФормы(ЭтаФорма, Объект.Организация);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаВФО.УстановкаФООрганизацияДляФормы(ЭтаФорма, Объект.Организация);
	
КонецПроцедуры
